improve README.
